src/test/java/DataFiles/OrgReport_DEA.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns="urn:lnrisk:ws:wshealthcare:(internal)@ver=999">
    <soap:Body>
        <OrganizationReportRequest>
            <User>
                <ExcludeDMVPII>1</ExcludeDMVPII>
                <DLMask>0</DLMask>
                <DataRestrictionMask>0000000000000000000000000000000000000</DataRestrictionMask>
                <DataPermissionMask>1111111111111111111111111111111111111111111111</DataPermissionMask>
                <SSNMaskingOn>0</SSNMaskingOn>
                <DLMaskingOn>0</DLMaskingOn>
                <LnBranded>0</LnBranded>
                <EndUser/>
                <OutcomeTrackingOptOut>0</OutcomeTrackingOptOut>
                <ArchiveOptIn>0</ArchiveOptIn>
                <AllowRoamingBypass>0</AllowRoamingBypass>
                <RunAsPolicy>RequestSettingFirst</RunAsPolicy>
                <GovernmentLogging>0</GovernmentLogging>
            </User>
            <HealthcareConfig/>
            <Options>
                <Blind>0</Blind>
                <Encrypt>0</Encrypt>
                <MinimizePII>0</MinimizePII>
                <IncludeIncomplete>0</IncludeIncomplete>
                <IncludeAllSets>0</IncludeAllSets>
                <IncludeSanctions>0</IncludeSanctions>
                <IncludeCoveredRecipients>0</IncludeCoveredRecipients>
                <IncludeSpecialties>0</IncludeSpecialties>
                <ExcludeFacilitySanction>0</ExcludeFacilitySanction>
                <ExcludeGSASanction>0</ExcludeGSASanction>
                <IncludeHealthIndustryNumbers>0</IncludeHealthIndustryNumbers>
                <IncludeGlobalLocationNumbers>0</IncludeGlobalLocationNumbers>
                <IncludeLicenses>0</IncludeLicenses>
                <IncludeFEIN>0</IncludeFEIN>
                <IncludeDEA>1</IncludeDEA>
                <IncludeNPI>0</IncludeNPI>
                <IncludeCLIA>0</IncludeCLIA>
                <IncludeAHA>0</IncludeAHA>
                <IncludePOS>0</IncludePOS>
                <IncludeNCPDP>0</IncludeNCPDP>
                <IncludeTaxonomy>0</IncludeTaxonomy>
                <IncludeMedicareId>0</IncludeMedicareId>
                <IncludeMedicaid>0</IncludeMedicaid>
                <IncludeStateControlledSubstance>0</IncludeStateControlledSubstance>
                <IncludeEssentialCommunityResources>0</IncludeEssentialCommunityResources>
                <IncludeFacilityAttributes>0</IncludeFacilityAttributes>
                <IncludeAffiliations>0</IncludeAffiliations>
                <SuppressLicenseHistory>0</SuppressLicenseHistory>
                <SortAndRankLicenseTogether>0</SortAndRankLicenseTogether>
                <MixedCaseOutput>0</MixedCaseOutput>
            </Options>
            <ReportBy>
                <LNFID>POZ222EJ4S</LNFID>
                <BusinessIds/>
                <Address/>
            </ReportBy>
            <AccountContext>
                <Common>
                    <Usage/>
                </Common>
            </AccountContext>
        </OrganizationReportRequest>
    </soap:Body>
</soap:Envelope>